<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es">
  <head>
    <title>La l&iacute;nea de tiempo</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WIKI_img/Wiki.png" align="MIDDLE"> La l&iacute;nea de tiempo</div>
    <div style="text-align: left;" id="content_wikimode">
      <h2> Descripci&oacute;n de la l&iacute;nea de tiempo</h2>
      <div style="margin-left: 20px;">La l&iacute;nea de tiempo muestra las diapositivas que componen el proyecto, 
           y que consta de tres pistas:<br>
        <br>
        <img alt="" src="../../WIKI_img/Timeline.png"><br>
        <br>
        <table style="text-align: left;" border="0" cellpadding="2" cellspacing="0">
          <tbody>
            <tr>
              <td style="vertical-align: top;"><img checked="true" style="width: 24px; height: 24px;"
                  src="../../img/fifteenpieces.png"><br>
              </td>
              <td style="vertical-align: top;">La pista de fondo: las diapositivas aparecen de izquierda a derecha. 
                 Para cada diapositiva se muestra:
                <ul>
                  <li>Un icono correspondiente a la transici&oacute;n seleccionada
                     para pasar de los fondos anteriores a esta diapositiva
                     (si se define un nuevo fondo). .</li>
                  <li>Una miniatura representando el fondo que est&aacute; asociado
                    con su diapositiva. </li>
                </ul>
              </td>
            </tr>
            <tr>
              <td style="vertical-align: top;"><img checked="true" style="width: 24px; height: 24px;"
                  src="../../img/object_movie.png"><br>
              </td>
              <td style="vertical-align: top;">La pista de montaje: las diapositivas aparecen de izquierda a derecha. 
                   Cada diapositiva est&aacute; representado por:
                <ul>
                  <li>Un icono correspondiente a la transici&oacute;n seleccionada
                     y que enlaza la diapositiva anterior con la actual, bajo la cual
                     se indica la duraci&oacute;n de la transici&oacute;n en
                     segundos.</li>
                  <li>una miniatura que es una imagen est&aacute;tica representando a la
                     diapositiva, y que puede ser el t&iacute;tulo, una fotograf&iacute;a, o un
                     v&iacute;deo (y debajo se situar&iacute;a la banda sonora). </li>
                </ul>
                <div style="margin-left: 20px;">
                  <ul>
                    <li>Pos&iacute;blemente aparezca un icono <img checked="true" style="width: 16px; height: 16px; font-style: italic;"
                        src="../../img/zoom.png"> debajo, a la izquierda
                      si existe una animaci&oacute;n de la diapositiva (formada
                      por una o m&aacute;s tomas).</li>
                    <li>La miniatura representa la primera imagen 
                      de la diapositiva.</li>
                  </ul>
                </div>
              </td>
            </tr>
            <tr>
              <td style="vertical-align: top;"><img checked="true" style="width: 16px; height: 16px;"
                  src="../../img/object_sound.png"><br>
              </td>
              <td style="vertical-align: top;">La pista de m&uacute;sica:<br>
                <ul>
                  <li>Cada lista de reproducci&oacute;n se muestra por una alternancia de color.
                  </li>
                  <li>la pista se llena m&aacute;s o menos dependiendo
                     del volumen de sonido seleccionado, mostrando c&oacute;mo va variando
                     volumen.</li>
                  <li>Las transiciones musicales (fade in/out) se muestran bajo la forma de
                     cruces.</li>
                  <li>Las posibles pausas est&aacute;n simbolizadas por un cambio en el
                     el volumen a cero y con el icono <img checked="true" style="width: 24px; height: 24px;"
                      src="../../img/player_pause.png">. </li>
                </ul>
              </td>
            </tr>
          </tbody>
        </table>
        <br>
        La l&iacute;nea de tiempo tiene 2 formas de mostrarse diferentes:<br>
        <ul>
          <li>Modo previsualizaci&oacute;n</li>
        </ul>
        <div style="margin-left: 80px;">En el modo previsualizaci&oacute;, lo fundamental es el reproductor multimedia, 
           que ocupa la zona principal del area disponible.<br>
          La l&iacute;a de tiempo se reduce a una sencilla l&iacute;a. </div>
        <ul>
          <li>Modo hoja </li>
        </ul>
        <div style="margin-left: 80px;">En el modo hoja, se da prioridad
           a las miniaturas de las diapositivas, y que ocupa la zona principal del area disponible.<br>
          El reproductor multimedia se reduce a un peque&ntilde;o espacio situado cerca de
           la barra de herramientas.<br>
          Las miniaturas de las diapositivas se muestran en varias l&iacute;neas como si fueran pentagramas de
           partitura.<br>
        </div>
        <br>
        <h3>Modificar un elemento:</h3>
        <ul>
          <li>Para modificar el fondo, hacemos doble click en la miniatura que representa al fondo. 
             Esta acci&oacute;n abre el apartado<a href="dlg_004.html"> Configurar el fondo</a>.<br>
          </li>
          <li>Para modificar la transici&oacute;n entrante, hacemos doble click
            en la transici&oacute;n de la diapositiva. Esta acci&oacute;n abre el apartado <a href="dlg_009.html">Configurar
            las transiciones de las diapositivas</a>.<br>
          </li>
          <li>Para modificar las diapositivas (encuadre, filtros, animaci&oacute;n, etc.)
            hacemos doble click en la miniatura. Esta acci&oacute;n abre el apartado <a href="dlg_003.html">Modificando

              las diapositivas</a>.<br>
          </li>
          <li>Para modificar la m&uacute;sica asociada a las diapositivas,
            hacemos doble click en la zona correspondiente a la pista de sonido. 
            Esta acci&oacute;n abre el apartado <a href="dlg_007.html">Configurar
              la pista de sonido</a>.<br>
          </li>
        </ul>
        <h3>Reordenar diapositivas en la l&iacute;a de tiempo</h3>
        <ul>
          <li>S&iacute;mplemente arrastrando  con el rat&oacute;n la diapositiva a una nueva posici&oacute;n
            (drag &amp; drop) </li>
        </ul>
        <h3>Modificar la visualizaci&oacute;n de la l&iacute;nea de tiempo:</h3>
        <div style="margin-left: 20px;">La configuraci&oacute;n de los comandos de la l&iacute;nea de tiempo est&aacute;n en la barra de estado, en la parte inferior derecha de la ventana principal.<br>
          <br>
          <img checked="true" style="width: 16px; height: 16px;" src="../../img/zoomup.png">
          Aumenta el tama&ntilde;o de las miniaturas, pero reduce el n&uacute;mero de
           miniaturas que se mostrar&aacute; en la l&iacute;nea de tiempo.<br>
          <img checked="true" style="width: 16px; height: 16px;" src="../../img/zoomdown.png">
          Reduce el tama&ntilde;o de las miniaturas, pero incrementa el n&uacute;mero de
          miniaturas que se mostrar&aacute; en la l&iacute;nea de tiempo.<br>
          <img checked="true" style="width: 16px; height: 16px;" alt=""
            src="../../img/player_play.png"> Cambia de pantalla al modo de previsualizaci&oacute;n<br>
          <img checked="true" style="width: 16px; height: 16px;" src="../../img/journal.png">
          Cambia de pantalla al modo de hoja </div>
      </div>
      <h2>Consulta tambi&eacute;n</h2>
      <ul>
        <li><a href="fct_001.html">&Iacute;ndice del WIKI de ffDiaporama</a></li>
        <li><a href="fct_004.html">Men&uacute; y comandos de la barra de herramientas</a></li>
      </ul>
      <br>
      <hr style="width: 100%; height: 2px;">ffDiaporama 1.0 - Julio 2011</div>
  </body>
</html>

