<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es">
  <head>
    <title>C&oacute;mo trabaja ffDiaporama</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WIKI_img/Wiki.png" align="MIDDLE"> C&oacute;mo funciona ffDiaporama<br>
    </div>
    <div style="text-align: left;" id="content_wikimode">
      <h2>Principios de Funcionamiento</h2>
      <div style="margin-left: 40px;">
        <div style="text-align: justify;">Las diapositivas se muestran una tras otra, en el orden en el que aparecen 
          en la l&iacute;nea de tiempo.<br>
          El diagrama siguiente muestra c&oacute;mo funciona el apartado de las diapositivas:<br>
        </div>
        <br>
        <div style="text-align: center;"><img checked="true" src="../../WIKI_img/Schema.png"><br>
        </div>
      </div>
      <h3 style="margin-bottom: 0cm; line-height: 100%; margin-left: 40px;">Las diapositivas</h3>
      <div style="margin-left: 40px;"><br>
        En la parte superior del diagrama est&aacute;n representadas las diapositivas <b>A</b>, <b>B</b>, <b>C</b> y <b>D</b>.<br>
      </div>
      <ul style="margin-left: 40px; text-align: justify;">
        <li>Cada diapositiva posee una transici&oacute;n (simbolizada en el diagrama por un peque&ntilde;o rect&aacute;ngulo etiquetado como  <b>T</b>). Las transiciones no tienen todas la misma duraci&oacute;n (simbolizado en el diagrama por las longitudes <b>TA'</b>, <b>TB'</b>, etc.): De hecho, es posible definir la duraci&oacute;n de cada transici&oacute;n para cada diapositiva (o para indicar que no hay ninguna transici&oacute;n:<b> duraci&oacute;n = 0</b>).</li>
        <li>Cada diapositiva tiene una duraci&oacute;n que es apropiada para <b>i</b> (simbolizado en el diagrama de la longitud de <b>B'</b>, <b>C'</b>, etc): Algunas tienen una duraci&oacute;n de unos pocos segundos, mientras que otras pueden durar varios minutos. Los tiempos se expresan en segundos, pero no son necesariamente n&uacute;meros enteros: un ejemplo, &uacute;ltima diapositiva ¡12.234 segundos!</li>
        <li>Cada diapositiva es una composici&oacute;n, un conjunto de uno o m&aacute;s elementos multimedia que se animan en el tiempo. La animaci&oacute;n se realiza a trav&eacute;s de planos o tomas. </li>
        <li>En cada diapositiva se puede definir un plano de fondo (detr&aacute;s de todas los planos).</li>
        <li>En cada diapositiva se puede definir una nueva lista de reproducci&oacute;n.</li>
      </ul>
      <div style="margin-left: 120px; text-align: justify;">Las diapositivas en las que no se ha configurado 
         un fondo utilizan el fondo definido en una diapositiva anterior. He aqu&iacute; un ejemplo:</div>
      <ul style="margin-left: 120px; text-align: justify;">
        <li> Diapositiva 1 - Se ha configurado un fondo</li>
        <li> Diapositiva 2 - No se ha definido un fondo, por lo tanto utiliza
           el fondo definido en la diapositiva 1</li>
        <li> Diapositiva 3 - No se ha definido un fondo, por lo tanto utiliza
           el fondo definido en la diapositiva 1</li>
        <li> Diapositiva 4 - Se ha configurado un fondo</li>
        <li> Diapositiva 5 - No se ha definido un fondo, por lo tanto utiliza
           el fondo definido en la diapositiva 4</li>
      </ul>
      <div style="margin-left: 120px; text-align: justify;"> Este mismo principio se aplica a la lista de reproducci&oacute;n de m&uacute;sica. Si en las diapositivas no se configura una nueva lista de reproducci&oacute;n, se usa la &uacute;ltima lista a&ntilde;adida. </div>
      <h3 style="margin-bottom: 0cm; line-height: 100%; margin-left: 40px;">Tomas y Bloques<br>
      </h3>
      <div style="margin-left: 40px;"><br>
        <div style="text-align: justify;">La parte inferior del diagrama representa la diapositiva <b>C</b>.<br>
        </div>
      </div>
      <ul style="margin-left: 40px; text-align: justify;">
        <li>Cada diapositiva contiene uno o m&aacute;s tomas. Las tomas est&aacute;n representadas en el diagrama por los rect&aacute;ngulos <b>C1</b>, <b>C2</b>, <b>C3</b>, etc.
          &#8230; </li>
        <li>Cada toma tiene su propia duraci&oacute;n (simbolizado en el diagrama con
           las longitudes <b>C1</b>, <b>C2</b>, <b>C3</b>, etc.).<br> Algunas tomas pueden durar s&oacute;lo
           algunos segundos, mientras que otras pueden durar varios minutos. Otras tomas pueden
           tener una duraci&oacute;n cero.<br> (Los tiempos se expresan en
           segundos, pero no son necesariamente n&uacute;meros enteros: Una toma puede
           durar perfectamente ¡12.234 segundos! )</li>
        <li>Las tomas contienen varios objetos multimedia. Los objetos multimedia se integran en bloques que pueden ser de
           tres tipos: el t&iacute;tulo (que contiene s&oacute;lo texto), im&aacute;genes (o fotos),
           y v&iacute;deo. </li>
        <li>Las tomas son transparentes. Esto significa que si la imagen
           no ocupa toda la pantalla, el fondo aparecer&aacute;.</li>
      </ul>
      <div style="margin-left: 40px; text-align: justify;"><span style="text-decoration: underline;">Notas:
        </span><br>
        <ul>
          <li>Las tomas definen la disposici&oacute;n de los bloques (objetos
             multimedia) en un momento dado.</li>
          <li>Las animaciones de las tomas se generan por la transformaci&oacute;n de
             estas posiciones que se lleva a cabo de una toma a otra. </li>
        </ul>
      </div>
      <div style="margin-left: 40px; text-align: justify;">Concretando,
         si en el primer plano la imagen ocupa toda la pantalla, y
         despu&eacute;s s&oacute;lo ocupa una peque&ntilde;a parte de la pantalla en la siguiente
         toma,<br> entonces la animaci&oacute;n estar&aacute; formada por la transformaci&oacute;n de
         &eacute;sta ocupando toda la pantalla (toma previa) hasta ocupar s&oacute;lo
         una peque&ntilde;a parte de la pantalla (toma siguiente).<br>
        <br>
      </div>
      <div style="margin-left: 80px; text-align: justify;">&#160;
        Ejemplo:<br>
        <div style="margin-left: 40px;"><img checked="true" src="../../WIKI_img/Animation_1.png"><br>
        </div>
      </div>
      <ul style="margin-left: 80px; text-align: justify;">
        <li>Toma 1: La imagen ocupa la pantalla entera: Duraci&oacute;n=2 segundos. </li>
        <li>Toma 2: La imagen s&oacute;lo ocupa el cuadrante inferior derecho:
          Duraci&oacute;n 3 segundos. </li>
        <li>Toma 3: La imagen vuelve a ocupar otra vez la pantalla entera: Duratci&oacute;n=2
          segundos. </li>
      </ul>
      <ul style="margin-left: 40px; text-align: justify;">
        <li>Resultado: la imagen se mostrar&aacute; en la pantalla completa durante 2
          segundos, encoger&aacute; gradualmente durante otros 3 segundos hacia el
          el cuadrante inferior derecho de la pantalla,<br> y luego crecer&aacute; otra vez
          durante 2 segundos hasta que una vez m&aacute;s ocupe la pantalla entera. </li>
        <li>La diapositiva terminar&aacute; tan pronto como la imagen haya llegado a la
           posici&oacute;n definida en la toma 3ª. </li>
      </ul>
      <div style="margin-left: 40px; text-align: justify;"><span style="text-decoration: underline;">Notas:</span><br>
        <ul>
          <li>Las transformaciones son graduales: en el ejemplo que hemos visto
             la imagen va reduci&eacute;dose gradualmente. </li>
          <li>Las transformaciones tienen lugar durante toda la duraci&oacute;n de
            la toma siguiente. </li>
        </ul>
        <br>
        La definici&oacute;n de los objetos en cada bloque puede variar de una
         toma a otra. En el siguiente ejemplo se puede comprobar tres diferentes
         definiciones en el mismo bloque:<br>
        <div style="margin-left: 40px;"><img checked="true" src="../../WIKI_img/Animation_2.png"><br>
        </div>
      </div>
      <ul style="margin-left: 40px; text-align: justify;">
        <li> 1ª toma: La imagen est&aacute; completa.</li>
        <li> 2ª toma: La imagen se ha enmarcado en la zona de la estatua.</li>
        <li> 3ª toma: La imagen se ha enmarcado en la zona de los peatones.</li>
      </ul>
      <div style="margin-left: 40px; text-align: justify;">Si miramos en el
        ejemplo propuesto de la estatua, m&aacute;s arriba: </div>
      <ul style="margin-left: 40px; text-align: justify;">
        <li>La imagen completa se muestra en toda la pantalla durante 2
           segundos, luego va disminuyendo de tama&ntilde;o gradualmente durante 3 segundos<br>
           haciendo un zoom sobre la imagen en el cuadrante inferior derecha de la
           pantalla, entonces crece durante otros 2 segundos hasta que, una vez m&aacute;s,<br>
           ocupa toda la pantalla mientras se mueve hacia la zona de los
           peatones.</li>
      </ul>
      <div style="margin-left: 40px; text-align: justify;"><span style="text-decoration: underline;">Notas:
        </span><br>
      </div>
      <ul style="margin-left: 40px; text-align: justify;">
        <li>ffDiaporama puede gestionar cientos de diapositivas en un
           solo proyecto. <br>
        </li>
        <li>Cada diapositiva puede contener decenas de tomas.</li>
        <li>Cada diapositiva puede contener decenas de bloques.</li>
        <li>Los bloques pueden ser visibles en algunas tomas e invisibles en otras.</li>
      </ul>
      <div style="margin-left: 40px; text-align: justify;">
        <h3>La propiedad "Visible" de los bloques y la gesti&oacute;n de las pausas<br>
        </h3>
        <div style="margin-left: 40px;">Los bloques poseen las propiedad visible o invisible. 
          En el siguiente ejemplo, la imagen se inserta 3 veces 
          (en 3 bloques diferentes) en una misma diapositiva.
          <ul>
            <li>El primer bloque muestra la imagen completa,
              ocupando la pantalla entera </li>
            <li>El segundo bloque muestra la imagen, con la
               estatua enmarcada y posicionada en una elipse, a la derecha de la
               pantalla </li>
            <li>El tercer bloque muestra la imagen con el sector de los peatones enmarcado
                y tambi&eacute;n posicionado en una elipse, a la derecha
               de la pantalla </li>
          </ul>
          <img alt="" src="../../WIKI_img/Animation_3.png"><br>
          La estatua y los peatones tienen la propiedad de visibilidad establecida como 'invisible' en la 1ª toma.<br>
          Despu&eacute;s, la estatua se hace visible en la 2ª toma.<br>
          Finalmente, la estatua se vuelve invisible otra vez  en la 3ª toma, y los peatones se hacen visibles a su vez.<br>
          <br>
          Resultado :<br>
          <ul>
            <li>Durante 2 segundos la 1ª toma se muestra y podemos contemplar 
             la imagen completa en la pantalla.</li>
            <li>Durante los 2 segundos siguientes, va apareciendo la estatua </li>
            <li>Durante los otros 2 segundos siguientes, la estatua es sustitu&iacute;da
             por los peatones </li>
          </ul>
          Este ejemplo es muy simple, tambi&eacute;n es
          posible animar la aparici&oacute;n y desaparici&oacute;n de
          bloques.<br>
          En efecto, como se indic&oacute; anteriormente, las animaciones se generan a causa
          de las transformaciones que vamos creando de una toma a otra. <br>
          Por lo tanto, si en la 1ª toma, la estatua ocupa el cuadrante inferior izquierdo de la pantalla,
          en el mismo lugar que ocupa en la 2ª toma,<br> entonces en vez de aparecer s&iacute;mplemente durante 2 segundos en
          esta 2ª toma, aparecer&aacute; aumentando desde su situaci&oacute;n original en el cuadrante inferior izquierdo. <br>
          <br>
          Hay que tener en cuenta que los v&iacute;deos se detienen cuando son invisibles.<br>
          Por lo tanto, el video del ejemplo se visualiza durante varios segundos en la 1ª toma, 
          y despu&eacute;s se hace invisible, detieni&eacute;ndose en la 2ª toma,<br>
          y luego se muestra visible en la 3ª toma, y volve a aparecer a partir desde
          donde se detuvo, al final de la 1ª toma.<br>
        </div>
        <h3>Nota:</h3>
         La duraci&oacute;n total del proyecto no es igual a la suma de la
         duraci&oacute;n de las diapositivas porque las transiciones hacen que las diapositivas
         se superpongan: Dos diapositivas de 10 segundos, cada una con una transici&oacute;n de 1 segundo, 
         el resultado ser&aacute; una duraci&oacute;n total del proyecto de 19 segundos
         (y no de 20 segundos)! </div>
      <br>
      <h2>Consulta tambi&eacute;n</h2>
      <ul>
        <li><a href="fct_001.html">&Iacute;ndice del WIKI de ffDiaporama</a></li>
      </ul>
      <br>
      <hr style="width: 100%; height: 2px;">ffDiaporama 1.0 - Julio 2011</div>
  </body>
</html>

