<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es">
  <head>
    <title>Noticias de ffDiaporama</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WEB_img/icon_news.png" align="MIDDLE"> Noticias de
      ffDiaporama</div>
    <div style="text-align: left;" id="content_wikimode">
      <h5>18/09/2011 - Un nuevo FORO</h5>
      <div style="margin-left: 40px;"><b>Nueva y gran noticia</b>: el anterior Foro
        funcionaba sobre la base de un simple grupo de Google y no era suficiente, as&iacute; que<br>
        tenemos que dar gracias a Alain Wasniewski, que nos ha preparado este nuevo foro, ya disponible en: <a
         href="http://ffdiaporama.tuxfamily.org/Forum/">http://ffdiaporama.tuxfamily.org/Forum/</a><br>
        Sentimos mucho las molestias, pero las personas que se hab&iacute;an unido al foro anterior
        han de registrarse en el nuevo. Gracias<br>
      </div>
      <h5>11/09/2011 : Cuarta Beta  liberada</h5><br>

      <div style="margin-left: 40px;">Para esta cuarta Beta
         se han hecho esfuerzos en la internacionalizaci&oacute;n,
         a&ntilde;adiendo la traducci&oacute;n al espa&ntilde;ol (interfaz 100% - Wiki 20%),<br> 
         y traducci&oacute;n al italiano (interfaz 100% - Wiki 0%).<br>
        <br>
        Al mismo tiempo, una gran cantidad de errores corregidos :<br>
        <ul>
          <li>Error en previsualizaci&oacute;n  (Equipos antiguos y M&aacute;quina Virtual)</li>
          <li>Di&aacute;logo de diapositiva se rompe cuando se elimina una toma</li>
          <li>Error de nombre de directorio cuando se genera el sonido</li>
          <li>Error en el nombre de repertorio, en la generaci&oacute;n de la pista de sonido</li>
          <li>Crujidos en la generaci&oacute; del sonido (error de muestreo)</li>
          <li>Algunos archivos de v&iacute;deo se niegan a abrir (formato no compatible)</li>
          <li>La orientaci&oacute;n de las fotos no se detecta a&uacute;n  correctamente
             (seg&uacute;n el idioma del sistema, puede funcionar o no)</li>
          <li>Los acentos no se decodifican correctamente en los datos EXIF​​, XMP
             e IPTC</li>
          <li>Error en el c&aacute;lculo cuando no hay transici&oacte;n</li>
          <li>Las im&aacute;genes de v&iacute;deos anam&oacute;rficos (DVD-16/9) no se muestran</li>
          <li>Errores de redondeo en los c&aacute;lculos en los tama&ntilde;os de
             p&iacute;xeles, en el cuadro de di&aacute;logo de diapositivas</li>
          <li>Unos bordes par&aacute;sitos peque&ntilde;os  aparecen a la derecha y debajo,
             alrededor de las diapositivas. (Parcialmente solucionado)</li>
          <li>Problema de refresco en la vistas de la aplicaci&oacte;n en algunos PC con Linux 
            usando KDE [s&oacute;lo en algunos entornos Linux]</li>
          <li>La ventana principal se queda congelada hasta que se mueve o se redimensiona
             [s&oacute;lo en sistemas Windows]</li>
        </ul>
      </div>
      <h5>26/08/2011 : Tercera Beta liberada</h5><br>
      
      <div style="margin-left: 40px;">Pues s&iacute;, las vacaciones ya han terminado
         y estamos aqu&iacute;, con miles de pel&iacute;culas y fotos; y para reducir un poco la carga de trabajo te proponemos una
         nueva versi&oacute;n beta,<br>  incluyendo una serie de
         mejoras en la vista previa y en el renderizado (de un 15% a
         un 50% m&aacute;s r&aacute;pido, dependiendo de la composici&oacute;n del proyecto).<br>
        <br>
        Durante este tiempo:<br>
        <ul>
          <li>Alg&uacute;n bug solucionado.</li>
          <li>&Uacute;ltima parte de las correcciones del Ingl&eacute;s
             documentaci&oacute;n. Much&iacute;simas gracias a Russman Hazel que
             est&aacute; corrigiendo todos mis errores gramaticales en Ingl&eacute;s.</li>
          <li>A&ntilde;adidos nuevos atajos de teclado.</li>
          <li>Algunos fondos nuevos en la biblioteca de ffDiaporama.<br>
          </li>
        </ul>
      </div>
      <h5>05/08/2011 : Segunda Beta liberada, y vacaciones.<br>
      </h5>
      <div style="margin-left: 40px;">Hola a todos,<br>
        <br>
        Eso es todo, el momento tan esperado llega por fin: &iexcl;esto queda cerrado por vacaciones!<br>
        <br>
        Antes de mis vacaciones, propongo otra versi&oacute;n beta.<br>
        <br>
        Se integrar&aacute;n las correcciones de los &uacute;ltimos errores:<br>
        <ul>
          <li>Corregido el error del reproductor de v&iacute;deo de la ventana de edici&oacute;n de v&iacute;deo
             que para de forma aleatoria.</li>
          <li>Corregidos algunos aspectos de la traducci&oacute;n al franc&eacute;s.<br>
          </li>
          <li>Invertidos los iconos play/pausa en el reprocuctor.</li>
          <li>Colocaci&oacute;n de buenos textos en los botones para las secciones aumentar / reducir
             las miniaturas de tama&ntilde;o, y los modos de vista.<br>
          </li>
          <li>Colocaci&oacute;n de los botones del render en el mismo orden tanto en vista completa de la aplicaci&oacute;n como en modo vista previa.<br>
          </li>
          <li>Solucionado el problema de lectura de algunos archivos .ogg (Vorbis).</li>
        </ul>
        Tambi&eacute;n se ha integrado la primera parte de las correcciones de la
         documentaci&oacute;n en Ingl&eacute;s.<br>
        <div style="margin-left: 40px;">Much&iacute;simas gracias a Hazel
           que comenz&oacute; a corregir todos mis errores gramaticales en Ingl&eacute;s. <br>
           (Y como yo no soy muy bueno en Ingl&eacute;s, es un trabajo enorme
           el que est&aacute; haciendo)<br>
        </div>
        <br>
        Se integra dos nuevos perfiles de video para Daily Motion y YouTube.<br>
        <br>
        Finalmente, &uacute;ltimas noticias: la publicaci&oacute;n en l&iacute;nea
        de una versi&oacute;n port&aacute;til de ffDiaporama para <a href="http://www.framakey.org/">Framakey</a>.<br>
        <br>
        Por el momento no se han recibido m&aacute;s bugs.<br>
        <br>
        Si en las 2 o 3 semanas pr&oacute;ximas, no hay nuevos bugs,
         la &uacute;ltima versi&oacute;n beta se convertir&aacute; en la primera versi&oacute;n estable.<br>
        <ul>
          <li>Es posible que Hazel haya terminado de corregir la
             Documentaci&oacute;n en Ingl&eacute;s - De momento, la mitad de las p&aacute;ginas
             ya est&aacute;n corregidas.</li>
          <li>He colocado en la p&aacute;gina "<a href="Contribute.php">Contribuir</a>"
            los archivos &nbsp;<b><i>.ts</i></b>&nbsp; para los diferentes idiomas. Si algunos
             ten&eacute;is el coraje de traducir estos archivos (con Qt
             Linguist), eso permitir&aacute; incluir m&aacute;s idiomas en
             la primera versi&oacute;n estable.</li>
        </ul>
        Gracias por todo y buenas vacaciones.<br>
      </div>
      <br>
      <br>
      <div style="text-align: center;"><a checked="true" href="News_old_01.php">Consultar antiguas noticias<br></a>
    </div>
      <br>
      <hr style="width: 100%; height: 2px;">&#169; Proyecto ffDiaporama
</div>
  </body>
</html>

