<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="es">
  <head>
    <title>Noticias de ffDiaporama</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WEB_img/icon_news.png" align="MIDDLE"> Noticias de
      ffDiaporama&#160;</div>
    <div style="text-align: left;" id="content_wikimode">
      <h5>11/09/2011 : Cuarta Beta liberada</h5>
      <br>
      <div style="margin-left: 40px;">Para esta cuarta Beta se han hecho
        esfuerzos en la internacionalizaci&#243;n, a&#241;adiendo la
        traducci&#243;n al espa&#241;ol (interfaz 100% - Wiki 20%),<br>
        y traducci&#243;n al italiano (interfaz 100% - Wiki 0%).<br>
        <br>
        Al mismo tiempo, una gran cantidad de errores corregidos :<br>
        <ul>
          <li>Error en previsualizaci&#243;n (Equipos antiguos y
            M&#225;quina Virtual)</li>
          <li>Di&#225;logo de diapositiva se rompe cuando se elimina una
            toma</li>
          <li>Error de nombre de directorio cuando se genera el sonido</li>
          <li>Error en el nombre de repertorio, en la generaci&#243;n de
            la pista de sonido</li>
          <li>Crujidos en la generaci&#243; del sonido (error de
            muestreo)</li>
          <li>Algunos archivos de v&#237;deo se niegan a abrir (formato
            no compatible)</li>
          <li>La orientaci&#243;n de las fotos no se detecta a&#250;n
            correctamente (seg&#250;n el idioma del sistema, puede
            funcionar o no)</li>
          <li>Los acentos no se decodifican correctamente en los datos
            EXIF&#8203;&#8203;, XMP e IPTC</li>
          <li>Error en el calculo cuando no hay transici&amp;oacte;n</li>
          <li>Las im&#225;genes de v&#237;deos anam&#243;rficos
            (DVD-16/9) no se muestran</li>
          <li>Errores de redondeo en los c&#225;lculos en los
            tama&#241;os de p&#237;xeles, en el cuadro de di&#225;logo
            de diapositivas</li>
          <li>Unos bordes par&#225;sitos peque&#241;os aparecen a la
            derecha y debajo, alrededor de las diapositivas.
            (Parcialmente solucionado)</li>
          <li>Problema de refresco en la vistas de la
            aplicaci&amp;oacte;n en algunos PC con Linux usando KDE
            [s&#243;lo en algunos entornos Linux]</li>
          <li>La ventana principal se queda congelada hasta que se mueve
            o se redimensiona [s&#243;lo en sistemas Windows]</li>
        </ul>
      </div>
      <h5>26/08/2011 : Tercera Beta liberada</h5>
      <br>
      <div style="margin-left: 40px;">Pues s&#237;, las vacaciones ya
        han terminado y estamos aqu&#237;, con miles de pel&#237;culas y
        fotos; y para reducir un poco la carga de trabajo te proponemos
        una nueva versi&#243;n beta,<br>
        incluyendo una serie de mejoras en la vista previa y en el
        renderizado (de un 15% a un 50% m&#225;s r&#225;pido,
        dependiendo de la composici&#243;n del proyecto).<br>
        <br>
        Durante este tiempo:<br>
        <ul>
          <li>Alg&#250;n bug solucionado.</li>
          <li>&#218;ltima parte de las correcciones del Ingl&#233;s
            documentaci&#243;n. Much&#237;simas gracias a Russman Hazel
            que est&#225; corrigiendo todos mis errores gramaticales en
            Ingl&#233;s.</li>
          <li>A&#241;adidos nuevos atajos de teclado.</li>
          <li>Algunos fondos nuevos en la biblioteca de ffDiaporama.<br>
          </li>
        </ul>
      </div>
      <h5>05/08/2011 : Segunda Beta liberada, y vacaciones.<br>
      </h5>
      <div style="margin-left: 40px;">Hola a todos,<br>
        <br>
        Eso es todo, el momento tan esperado llega por fin: &#161;esto
        queda cerrado por vacaciones!<br>
        <br>
        Antes de mis vacaciones, propongo otra versi&#243;n beta.<br>
        <br>
        Se integrar&#225;n las correcciones de los &#250;ltimos errores:<br>
        <ul>
          <li>Corregido el error del reproductor de v&#237;deo de la
            ventana de edici&#243;n de v&#237;deo que para de forma
            aleatoria.</li>
          <li>Corregidos algunos aspectos de la traducci&#243;n al
            franc&#233;s.<br>
          </li>
          <li>Invertidos los iconos play/pausa en el reprocuctor.</li>
          <li>Colocaci&#243;n de buenos textos en los botones para las
            secciones aumentar / reducir las miniaturas de tama&#241;o,
            y los modos de vista.<br>
          </li>
          <li>Colocaci&#243;n de los botones del render en el mismo
            orden tanto en vista completa de la aplicaci&#243;n como en
            modo vista previa.<br>
          </li>
          <li>Solucionado el problema de lectura de algunos archivos
            .ogg (Vorbis).</li>
        </ul>
        Tambi&#233;n se ha integrado la primera parte de las
        correcciones de la documentaci&#243;n en Ingl&#233;s.<br>
        <div style="margin-left: 40px;">Much&#237;simas gracias a Hazel
          que comenz&#243; a corregir todos mis errores gramaticales en
          Ingl&#233;s. <br>
          (Y como yo no soy muy bueno en Ingl&#233;s, es un trabajo
          enorme el que est&#225; haciendo)<br>
        </div>
        <br>
        Se integra dos nuevos perfiles de video para Daily Motion y
        YouTube.<br>
        <br>
        Finalmente, &#250;ltimas noticias: la publicaci&#243;n en
        l&#237;nea de una versi&#243;n port&#225;til de ffDiaporama para
        <a href="http://www.framakey.org/">Framakey</a>.<br>
        <br>
        Por el momento no se han recibido m&#225;s bugs.<br>
        <br>
        Si en las 2 o 3 semanas pr&#243;ximas, no hay nuevos bugs, la
        &#250;ltima versi&#243;n beta se convertir&#225; en la primera
        versi&#243;n estable.<br>
        <ul>
          <li>Es posible que Hazel haya terminado de corregir la
            Documentaci&#243;n en Ingl&#233;s - De momento, la mitad de
            las p&#225;ginas ya est&#225;n corregidas.</li>
          <li>He colocado en la p&#225;gina "<a href="Contribute.php">Contribuir</a>"
            los archivos &#160;<b><i>.ts</i></b>&#160; para los
            diferentes idiomas. Si algunos ten&#233;is el coraje de
            traducir estos archivos (con Qt Linguist), eso
            permitir&#225; incluir m&#225;s idiomas en la primera
            versi&#243;n estable.</li>
        </ul>
        Gracias por todo y buenas vacaciones.<br>
      </div>
      <br>
      <br>
      <div style="text-align: center;"><a checked="true" href="News_old_01.php">Consultar
          antiguas noticias<br>
        </a> </div>
      <br>
      <hr style="width: 100%; height: 2px;">&#169; Proyecto ffDiaporama
    </div>
  </body>
</html>
