<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="fr">
  <head>
    <title>Des nouvelles de ffDiaporama</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WEB_img/icon_news.png" align="MIDDLE"> Des nouvelles
      de ffDiaporama <a href="CHANGE-LOG.html"><img alt="" src="../../WEB_img/Changelog.png"
          align="MIDDLE"></a> </div>
    <div style="text-align: left;" id="content_wikimode">
      <h5>26/09/2011 - Paquet et documentation pour openSUZE</h5>
      <div style="margin-left: 40px;">Un grand merci &#224; Indian qui
        nous propose aujourd'hui les paquets en version 32 et 64 bits et
        la documentation de compilation pour openSUZE 11.4.<br>
        Tous ces &#233;l&#233;ments sont disponibles dans la page de
        T&#233;l&#233;chargement.<br>
      </div>
      <h5>18/09/2011 - Changement de FORUM</h5>
      <div style="margin-left: 40px;">Le succ&#232;s venant, l'ancien
        forum bas&#233; sur un simple groupe de discussion Google ne
        suffisait plus.<br>
        Merci &#224; Alain Wasniewski qui nous a pr&#233;par&#233; ce
        vrai forum : <a href="http://ffdiaporama.tuxfamily.org/Forum/">http://ffdiaporama.tuxfamily.org/Forum/</a><br>
        D&#233;sol&#233;, mais les personnes qui s'&#233;taient
        inscrites sur l'ancien forum doivent se r&#233;-inscrire sur le
        nouveau.<br>
      </div>
      <h5>11/09/2011 - Quatri&#232;me version BETA :<br>
      </h5>
      <div style="margin-left: 40px;">Pour cette quatri&#232;me version
        b&#233;ta, un effort particulier a &#233;t&#233; fait pour
        l'internationalisation avec l'ajout des traductions en Espagnol
        (Interface 100% - Wiki 20%) et en Italien (Interface 100% - Wiki
        0%).<br>
        <br>
        Dans le m&#234;me temps, de nombreux buggs ont &#233;t&#233;
        r&#233;solus :<br>
        <ul>
          <li> Crash de la pr&#233;visualisation (PC ancien et VM)</li>
          <li>Crash dans la boite slide quand suppression de plan</li>
          <li>Mauvais nom de r&#233;pertoire lors de la
            g&#233;n&#233;ration de la piste musicale</li>
          <li>Les fichiers suivants de la playlist musicale sont
            ignor&#233;s</li>
          <li>Crachotement dans le son apr&#232;s g&#233;n&#233;ration</li>
          <li>Certains fichiers vid&#233;os refusent de s'ouvrir (format
            non compatible)</li>
          <li>L'orientation des photos n'est pas toujours correctement
            d&#233;tect&#233;e (selon la langue du syst&#232;me, cela
            marche ou pas)</li>
          <li>Les accents ne sont pas correctement d&#233;cod&#233;s
            dans les donn&#233;es EXIF, XMP et IPTC</li>
          <li>Erreur dans le calcul des dur&#233;es mini quand pas de
            transition</li>
          <li>Les images des vid&#233;os anamorphiques (DVD-16/9eme) ne
            s'affichent pas</li>
          <li>Des erreurs d'arrondis apparaissent dans les calculs des
            tailles en pixel dans la boite diapositive</li>
          <li>Une petite marge parasite appara&#238;t &#224; droite et
            en bas autour de la diapositive.</li>
          <li>Probl&#232;me de rafra&#238;chissement de l'affichage sur
            certains PC Linux sous KDE</li>
          <li>La fen&#234;tre principale ne s'affiche pas correctement
            sous Windows au d&#233;marrage de l'application si plein
            &#233;cran<br>
          </li>
        </ul>
      </div>
      <h5> 26/08/2011-Troisi&#232;me version BETA</h5>
      <div style="margin-left: 40px;">Et oui, les vacances sont finies
        et nous voila maintenant avec des milliers de films et de photos
        &#224; monter.<br>
        Pour r&#233;duire un peu la charge de travail que cela induit,
        je vous propose une nouvelle version beta comprenant tout une
        s&#233;rie d'am&#233;lioration des performances, &#224; la fois
        pour la pr&#233;visualisation et pour la g&#233;n&#233;ration
        (de 15% &#224; 50% plus rapide selon la composition des
        projets).<br>
        <br>
        Au passage :<br>
        <ul>
          <li>Encore quelques corrections de bug</li>
          <li>La fin de la correction des documentations en Anglais
            (Merci &#224; Hazel Russman pour sa contribution)</li>
          <li>L'ajout de nombreux raccourcis clavier</li>
          <li>Quelques nouveaux fonds dans la librairie<br>
          </li>
        </ul>
      </div>
      <h5>05/08/2011-Deuxi&#232;me version BETA et les vacances<br>
      </h5>
      <div style="margin-left: 40px;">Bonjour &#224; tous,<br>
        <br>
        &#199;a y est, l'instant tant attendu arrive enfin : je vais
        partir en vacance !<br>
        <br>
        Avant mon d&#233;part, je vous propose une derni&#232;re version
        b&#233;ta.<br>
        <br>
        Elle int&#232;gre la correction des derniers bugs :<br>
        <ul>
          <li>Corrige le bug du lecteur vid&#233;o de la boite &#233;dit
            vid&#233;o qui s&#8217;arr&#234;tait tout seul de fa&#231;on
            al&#233;atoire</li>
          <li>Remplace les &#171; annul&#233; &#187; par &#171; annuler
            &#187; [Traduction Fran&#231;aise]<br>
          </li>
          <li>Inverse les ic&#244;nes play/pause dans le lecteur</li>
          <li>Remet les bons intitul&#233;s pour les boutons
            augmenter/r&#233;duire la taille des vignettes et les
            boutons de mode</li>
          <li>Remet les boutons de g&#233;n&#233;ration de vid&#233;o
            dans le m&#234;me ordre en mode partition qu'en mode
            pr&#233;visualisation<br>
          </li>
          <li>Corrige le probl&#232;me de lecture de certains fichiers
            .ogg (Vorbis)<br>
          </li>
        </ul>
        Elle int&#232;gre &#233;galement la premi&#232;re partie des
        corrections des documentations anglaises.<br>
        <div style="margin-left: 40px;">Un tr&#232;s tr&#232;s grand
          merci &#224; Hazel qui a entrepris de corriger toutes mes
          fautes d'anglais.<br>
          (Et comme je ne suis vraiment pas bon en anglais, c'est un
          boulot &#233;norme qu'elle est en train de faire.)<br>
        </div>
        <br>
        Elle int&#232;gre deux nouveaux profils de g&#233;n&#233;ration
        de vid&#233;o pour Daily Motion et Youtube.<br>
        <br>
        Enfin, derni&#232;re nouveaut&#233; : la mise en ligne d'une
        version portable de ffDiaporama pour <a href="http://www.framakey.org/">Framakey</a>.<br>
        <br>
        A l'heure actuelle, il ne reste plus aucun bug ouvert.<br>
        <br>
        Si dans les 2 &#224; 3 semaines qui viennent, aucun nouveau bug
        n'est remont&#233;, cette derni&#232;re version b&#233;ta
        deviendra la premi&#232;re version stable. D'ici l&#224;, <br>
        <ul>
          <li>Il est probable qu'Hazel aura termin&#233; de corriger les
            documentations anglaises - Actuellement pr&#232;s de la
            moiti&#233; des pages sont d&#233;j&#224; corrig&#233;es.</li>
          <li>J'ai mis en ligne dans la page "<a checked="true" href="Contribute.html">Contribuer</a>",




















            des fichiers .ts pour plusieurs langues. Si certain d'entre
            vous ont le courage de traduire ces fichiers (avec Qt
            Linguist), cela permettra d'inclure de nouvelles langues
            dans la premi&#232;re version stable.</li>
        </ul>
        Merci &#224; tous et bonnes vacances.<br>
      </div>
      <br>
      <br>
      <div style="text-align: center;"><a checked="true" href="News_old_01.html">Consulter




















          les anciens messages</a><br>
      </div>
      <br>
      <hr style="width: 100%; height: 2px;">&#169; The ffDiaporama
      Project</div>
  </body>
</html>
