<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="fr">
  <head>
    <title>Des nouvelles de ffDiaporama</title>
    <meta content="text/html; charset=UTF-8" http-equiv="Content-Type">
    <link href="../ffDiaporama_style.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="banner_wikimode"><img checked="true" style="width: 48px; height: 48px;"
        src="../../WEB_img/icon_news.png" align="MIDDLE"> Des nouvelles
      de ffDiaporama&#160; </div>
    <div style="text-align: left;" id="content_wikimode">
      <h5>27/07/2011-Premi&#232;re version BETA</h5>
      <div style="margin-left: 40px;">Tout d'abord, cette version inclue
        des corrections de bugs et des nouveaut&#233;s, parmi lesquels :<br>
        <ul>
          <li>L'apparition de mode partition (affichage de la barre de
            temps sur plusieurs lignes)</li>
          <li>Le drag &amp; drop pour r&#233;organiser les diapositives</li>
          <li>Une nouvelle boite de dialogue pour r&#233;gler les fonds
            d'&#233;cran</li>
          <li>Des boutons de reset dans la boite de recadrage/correction
            d'image</li>
          <li>etc...</li>
        </ul>
        Passage en version BETA<br>
        <br>
        <div style="margin-left: 40px;">Au bout d'un moment, il faut
          bien se d&#233;cider &#224; sortir une version stable !<br>
          Pendant longtemps, la strat&#233;gie &#233;tait de dire que
          tant que la TODO-LIST ne serait pas vid&#233;e, on
          continuerait en mode alpha, mais il faut bien se rendre &#224;
          l'&#233;vidence : plus on ajoute de fonctionnalit&#233; et
          plus cela attire de nouvelles id&#233;es et de nouvelles
          entr&#233;es dans la TODO-LIST. R&#233;sultat : au lieu de se
          vider, elle se remplit !<br>
          A ce rythme l&#224;, il n'y aura jamais de version stable.
          Donc, pour marquer un point d'&#233;tape, on passe en
          b&#233;ta !<br>
          <br>
          Concr&#232;tement, cela signifie :<br>
          <ul>
            <li>qu'il n'y aura plus aucune nouveaut&#233; jusqu'&#224;
              la version stable</li>
            <li>que la chasse aux buggs est plus que jamais ouverte !</li>
          </ul>
          En fonction des d&#233;clarations de buggs, il y aura (ou pas)
          de BETA 2. L'objectif est si possible, de sortir la version
          1.0 (stable) avant fin Ao&#251;t.<br>
          <br>
          Merci d'avance &#224; tous ceux qui prendront le temps de
          s'inscrire sur le forum et de faire des d&#233;clarations de
          buggs.<br>
          <br>
          Je rappel que le forum est aussi l&#224; pour &#233;changer
          entre utilisateurs sur le logiciel, les fonctionnalit&#233;s
          qu'on souhaiterait y voir ajouter, etc...<br>
          <br>
          Aujourd'hui vous &#234;tes environ une centaine &#224; visiter
          ce site chaque semaine et pr&#232;s d'une quarantaine &#224;
          downloader chaque semaine la derni&#232;re version.<br>
          Aujourd'hui il n'y a que 2 inscrits sur le forum ???<br>
          <br>
          La r&#233;ussite de cette phase beta passe par vous : on ne
          peut pas penser &#224; tout, ni identifier tous les
          probl&#232;mes. S'il vous pla&#238;t, on ne vous demande pas
          d'argent, juste votre avis, alors, exprimez-vous ...<br>
        </div>
      </div>
      <h5>20/07/2011-Quatri&#232;me paquet alpha3</h5>
      <div style="margin-left: 40px;">Nouveaut&#233; fonctionnelle :<br>
        <ul>
          <li>Il est maintenant possible de faire sortir les blocs de
            l'&#233;cran</li>
          <li>Il est maintenant possible de changer la couleur de
            l'ombre des blocs<br>
          </li>
        </ul>
        + de nombreuses modifications d'ergonomie :<br>
        <ul>
          <li>Il est maintenant possible de d&#233;placer les blocs au
            clavier dans les zones interactives</li>
          <li>La boite "propri&#233;t&#233; des diapositives" a
            &#233;t&#233; enti&#232;rement repens&#233; pour limiter les
            cliques et les d&#233;placements de souris</li>
          <li>Les coordonn&#233;es de la zone dans boite de recadrage
            n'est plus exprim&#233; en niveau de zoom mais en
            largeur/hauteur</li>
          <li>etc...</li>
        </ul>
        + quelques corrections de bug et notamment celui sous Linux qui
        faisait confondre les fichiers .ffd avec les fichiers textes
        brut.<br>
        La solution mise en place passe par un nouveau type mime.
        L'association de fichier n'est pas encore automatique : il faut
        encore la 1ere fois associer manuellement les .ffd avec
        ffDiaporama, mais cela ne perturbe plus les &#233;diteurs de
        texte (gedit, kate, ...).<br>
      </div>
      <h5>20/07/2011-Probl&#232;me sur les t&#233;l&#233;chargements</h5>
      <div style="margin-left: 40px;">Depuis deux ou trois jours, il
        n'&#233;tait plus possible de t&#233;l&#233;charger quoi que ce
        soit depuis le site WEB. <span style="font-weight: bold;">Le
          probl&#232;me est maintenant r&#233;gl&#233;.</span>
        D&#233;sol&#233;.<br>
      </div>
      <h5>13/07/2011-Troisi&#232;me paquet alpha3</h5>
      <div style="margin-left: 40px;">Poursuite des travaux sur la base
        d'&#233;quipements avec l'ajout de pr&#232;s de 50 profils.<br>
        Ajout de nombreux formats et codecs pour supporter tous ces
        &#233;quipements.<br>
        Ajout d'un onglet de param&#233;trage des &#233;quipements dans
        la boite de configuration.<br>
        + quelques modifications d'interface demand&#233;es par
        Marie-No&#235;lle et Sestay<br>
      </div>
      <h5>07/07/2011-Premier paquet alpha3</h5>
      <div style="margin-left: 40px;">Mise en ligne d'un premier paquet
        alpha3 avec beaucoup de nouveaut&#233;s :<br>
        <ul>
          <li>Tout d'abord, un grand merci &#224; Zouly pour la nouvelle
            identit&#233; graphique de ffDiaporama : Nouveau logo,
            nouvel ic&#244;ne, nouveau SplashScreeen</li>
          <li>Refonte de la fen&#234;tre principale avec la suppression
            du menu d&#233;roulant et le passage &#224; un ruban
            permettant l'ajout de nouveaux boutons</li>
          <li>D&#233;but des travaux sur la base de donn&#233;es
            d'&#233;quipement (On compte beaucoup sur vos contributions
            concernant cette base de donn&#233;es, car nous sommes loin
            de poss&#233;der tous ces &#233;quipements : SVP, faites
            nous savoir si &#231;a marche !)<br>
          </li>
          <li>R&#233;solution des probl&#232;mes de multi-threading
            (traitements r&#233;partis sur les diff&#233;rents
            c&#339;urs/processeurs de la machine) ce qui am&#233;liore
            entre autre la pr&#233;visualisation et les performances en
            g&#233;n&#233;ration de vid&#233;o</li>
          <li>R&#233;solution des probl&#232;mes d'encodage en standard
            NTSC</li>
          <li>etc...</li>
        </ul>
        21:00 - Publication en urgence d'un second paquet alpha3 pour
        corriger une petite b&#234;tise - d&#233;sol&#233; !<br>
      </div>
      <h5>29/06/2011-Un cinqui&#232;me paquet alpha2 + une vid&#233;o de
        d&#233;mo<br>
      </h5>
      <div style="margin-left: 40px;">Mise &#224; jours des doc +
        quelques corrections de bug et ajustements : Un nouveau paquet
        d'installation est disponible dans la page de
        t&#233;l&#233;chargement<br>
        Publication d'une vid&#233;o de d&#233;monstration sur la <a href="index.html">page







          d'accueil</a><br>
      </div>
      <h5>26/06/2011-Mea culpa</h5>
      <div style="margin-left: 40px;">A vouloir aller trop vite, on fait
        des b&#234;tises ...<br>
        Finalement il restait encore quelques gros bug, donc du coup,
        une nouvelle "ultime" version alpha2 est mise en ligne dans la
        page de t&#233;l&#233;chargement.<br>
      </div>
      <h5>24/06/2011-Fin du cycle de d&#233;veloppement de l'alpha2</h5>
      <div style="margin-left: 40px;">Le cycle de d&#233;veloppement
        alpha2 se termine maintenant avec une ultime version des
        fichiers d'installation :<br>
        <div style="margin-left: 40px;">L'ensemble des bugs qui avaient
          &#233;t&#233; rep&#233;r&#233;s ont &#233;t&#233;
          corrig&#233;s et les fonctionnalit&#233;s pr&#233;vues pour
          cette version ont &#233;t&#233; impl&#233;ment&#233;es.<br>
        </div>
        Les derniers fichiers d'installation de la version alpha2 sont
        d&#232;s &#224; pr&#233;sent pr&#233;sents disponibles dans la
        page de t&#233;l&#233;chargement. Ils y resteront jusqu'&#224;
        la fin du cycle alpha3.<br>
        <br>
        Le cycle de d&#233;veloppement alpha3 commence ...<br>
      </div>
      <h5>22/06/2011-Mise en ligne des paquets d'installation pour
        Ubuntu</h5>
      <div style="margin-left: 40px;">Les paquets pour Ubuntu 10.10 et
        11.04 sont maintenant disponibles dans la page de
        t&#233;l&#233;chargement.<br>
        Ils remplacent les anciens BuildTest.<br>
      </div>
      <h5>19/06/2011- Build test 20110619</h5>
      <div style="margin-left: 40px;">Nombreuses corrections de bugg +
        ajout de quelques fonctionnalit&#233;s (surtout li&#233; &#224;
        l'utilisation d'objets vid&#233;o et &#224; la
        g&#233;om&#233;trie des images)<br>
      </div>
      <h5>13/06/2011 - Build test 20110613</h5>
      <div style="margin-left: 40px;">Mise en ligne du nouveau site WEB
        (d'autres modifications sont encore &#224; venir)<br>
        Mise en ligne du nouveau WIKI (Les pages ne sont pas encore
        toutes termin&#233;es).<br>
        Mise en ligne des paquets d'installation pour Fedora 14 et
        Fedora 15 (32 et 64 bits)<br>
        Nombreuses corrections de bug notamment touchant aux vid&#233;os
        incorpor&#233;es dans les projets <br>
      </div>
      <h5>09/06/2011 - Build test 20110609</h5>
      <div style="margin-left: 40px;">Corrections de bug<br>
        Ajout des formats de g&#233;n&#233;ration vid&#233;o
        320x240/320x180/320x136<br>
        Ajoute les traductions pour les messages textes de QT (Standard
        buttons, etc...)<br>
      </div>
      <h5>06/06/2011 - Ouverture d'un FORUM (Google groupe de
        discussion) pour ffDiaporama</h5>
      <div style="margin-left: 40px;"> Adresse du forum : <a href="http://groups.google.com/group/ffdiaporama">http://groups.google.com/group/ffdiaporama</a>
        <br>
        N'h&#233;sitez pas &#224; l'utiliser pour :
        <ul>
          <li>faire des commentaires,</li>
          <li>d&#233;clarer des buggs,</li>
          <li>proposer des am&#233;liorations,</li>
          <li>demander de l'aide,</li>
          <li>etc ...</li>
        </ul>
        De plus, comme de gros buggs Windows ont &#233;t&#233;
        constat&#233;s sur les combo-box qui ne s'ouvraient pas
        correctement, une nouvelle version du paquet Windows est mise en
        ligne d&#232;s ce soir dans la page de t&#233;l&#233;chargement.<br>
      </div>
      <h5>05/06/2011 - ffDiaporama 0.99.alpha2</h5>
      <div style="margin-left: 40px;"> Cette version est disponible dans
        la page de t&#233;l&#233;chargement.<br>
        Le passage en alpha2 se justifie par la modification de
        l'univers des slides :<br>
        <ul>
          <li>La version Alpha1 (comme videoporama) d&#233;finissait les
            slides comme &#233;tant une image ou une vid&#233;o sur
            laquelle s'appliquait une composition global</li>
          <li>Chaque slide &#233;tait compos&#233; d'une s&#233;rie de
            couple de plan mobile/plan fixe.</li>
          <li>Chaque couple de plan poss&#233;dait une composition</li>
        </ul>
        Dans le nouvel univers :<br>
        <ul>
          <li>Chaque slide est d&#233;fini comme &#233;tant une
            composition et une s&#233;rie de plan</li>
          <li>Pour chaque plan de la s&#233;rie on d&#233;finit les
            propri&#233;t&#233;s des blocs de la composition (les blocs
            existent dans tous les plans mais peuvent &#234;tre
            masqu&#233;s plan par plan)</li>
          <li>Les blocs de composition peuvent &#234;tre du texte, une
            photo ou une vid&#233;o</li>
        </ul>
        Ces modifications majeures entra&#238;nent une modification
        profonde de l'interface et du fichier de donn&#233;es.<br>
        (Note : D&#233;sol&#233; mais la compatibilit&#233; ascendante
        des anciennes sauvegardes n'est pas assur&#233;e)<br>
        <br>
        Gains cot&#233; interface :<br>
        <ul>
          <li>L'interface d'&#233;dition n'est plus compos&#233;e que
            d'une seule boite de dialogue de composition.</li>
          <li>Cette boite appelle par des boutons des boites
            d'&#233;dition de texte, de recadrage/correction, de filtre
            et d'&#233;dition vid&#233;o</li>
          <li>Cela devient beaucoup plus simple &#224; utiliser</li>
        </ul>
        Gains cot&#233; fonctionnalit&#233; :<br>
        <ul>
          <li>Il devient possible d'avoir plusieurs images/vid&#233;o
            sur un m&#234;me slide</li>
          <li>Il devient possible de r&#233;duire l'affichage des
            images/vid&#233;os : Elles n'occupent plus forc&#233;ment
            tout l'&#233;cran</li>
          <li>Il devient possible d'ajouter des animations de
            positionnement des images/vid&#233;os sur l'&#233;cran (en
            plus des effets ken burns)</li>
          <li>Il devient possible de jouer avec le positionnement
            arri&#232;re plan/premier plan entre les blocs</li>
          <li>Il devient possible d'appliquer une forme aux
            images/vid&#233;os (cercle, triangle, etc...) alors
            qu'avant, seul le rectangle &#233;tait possible</li>
        </ul>
        Dans les jours qui viennent, le site WEB et le WIKI seront
        enti&#232;rement refait et des pages de tutoriel pr&#233;sentant
        ces nouvelles fonctionnalit&#233;s feront leur apparition. <br>
      </div>
      <h5>13/05/2011 - Mise en ligne d'une cinqui&#232;me version de
        test</h5>
      <div style="margin-left: 40px;">Le travail sur les blocs a repris
        dans les onglets de composition avec l'apparition des rotations
        selon les 3 axes et l'utilisation d'image comme fond de forme.
        Quelques corrections de bug. Comme d'habitude, elle remplace
        l'ancienne dans la page de t&#233;l&#233;chargement.<br>
      </div>
      <h5>09/05/2011 - Mise en ligne d'une quatri&#232;me version de
        test</h5>
      <div style="margin-left: 40px;">ffDiaporama a &#233;t&#233;
        port&#233; sous Fedora 14 !<br>
        Outre les &#233;l&#233;ments li&#233;s &#224; Fedora, cette
        version contient quelques corrections de bug. Comme d'habitude,
        elle remplace l'ancienne dans la page de
        t&#233;l&#233;chargement.<br>
      </div>
      <h5>06/05/2011 - Mise en ligne d'une troisi&#232;me version de
        test</h5>
      <div style="margin-left: 40px;">Cette version a &#233;t&#233;
        test&#233; avec le nouvel Ubuntu 11.04. Elle contient de
        nombreuses corrections de bug et quelques simplifications
        d'interface. Cette troisi&#232;me version est disponible
        d&#232;s aujourd'hui dans la page de t&#233;l&#233;chargement.<br>
      </div>
      <h5>29/04/2011 - Mise en ligne d'une seconde version de test</h5>
      <div style="margin-left: 40px;">Merci &#224; tous ceux qui ont
        particip&#233; &#224; ce premier test. Les nombreuses
        remont&#233;es de bugg ont permis de consid&#233;rablement faire
        &#233;voluer l'application. N'h&#233;sitez pas &#224; continuer
        les tests avec cette seconde version disponible d&#232;s
        aujourd'hui dans la page de t&#233;l&#233;chargement.<br>
      </div>
      <h5>25/04/2011 - Mise en ligne de la premi&#232;re version de test
        : ffDiaporama 0.99.alpha1</h5>
      <p style="margin-left: 40px;">Apr&#232;s avoir particip&#233; au
        d&#233;veloppement (en Python) de 2 versions de Videoporama (<a
          href="http://videoporama.tuxfamily.org/">http://videoporama.tuxfamily.org</a>),
j'ai





































        d&#233;cid&#233; de repartir de z&#233;ro et de recommencer une
        nouvelle application en QT. Comme Videoporama, c'est une
        application de cr&#233;ation de s&#233;quences vid&#233;os
        constitu&#233;es :<br>
        - de titres, fixes ou anim&#233;es.<br>
        - d'images ou de photographies, fixes ou anim&#233;es.<br>
        - de clips vid&#233;o<br>
        - de musiques</p>
      <p style="margin-left: 40px;">Ces s&#233;quences sont
        assembl&#233;es en diaporama &#224; l'aide de transitions de
        s&#233;quence pour constituer des vid&#233;os compl&#232;tes.</p>
      <p style="margin-left: 40px;">Pour ffDiaporama, j'ai repris la
        plupart des fonctionnalit&#233;s de Videoporama :<br>
        - Recadrage des images, photos, titres et vid&#233;os<br>
        - D&#233;coupage des clips vid&#233;os<br>
        - Annotation (ajout de texte) des images, des photos, des
        vid&#233;os et des animations<br>
        - Cr&#233;ation d'animation par effet de zoom, de
        d&#233;placement sur des portions d'images (effet Ken Burns)<br>
        - Transitions entre s&#233;quences avec d&#233;finition
        s&#233;quence par s&#233;quence.<br>
        - Ajout de musique pendant le diaporama<br>
        - G&#233;n&#233;ration de vid&#233;os exploitables par la
        plupart des &#233;quipements vid&#233;os actuels (lecteurs de
        DVD de salon, disques durs multim&#233;dia, mobile/smartphone,
        etc ...) mais &#233;galement diffusables sur les principaux
        sites WEB de partage vid&#233;o (Youtube, Dailymotion, etc...)<br>
        - Format de vid&#233;o du VGA (640x640) au Full HD (1920x1080)
        en passant par les formats DVD et HD 720<br>
        - G&#233;om&#233;trie de l'image : 4:3, 16:9<br>
        - Formats de sortie possibles : avi, mpg, mp4, mkv, etc...</p>
      <p style="margin-left: 40px;">Et, j'en ai profit&#233; pour y
        ajouter pas mal de fonctionnalit&#233;s qui n'existaient pas
        encore, comme :<br>
        - Une preview temps r&#233;el du montage<br>
        - Des filtres graphiques (luminosit&#233;, contraste, gamma,
        passage en noir &amp; blanc, nettet&#233;, flou, etc...)<br>
        - Rotation dans les effets ken burns<br>
        - Effets de volume, de fondu et passage en pause des musiques
        param&#233;trables s&#233;quence par s&#233;quence.<br>
        - G&#233;om&#233;trie de l'image cin&#233;ma (2.35:1)<br>
        - etc...</p>
      <p style="margin-left: 40px;">Bien-sur, je suis toujours en
        contact avec l'&#233;quipe de Videoporama, et des discussions
        sont en cours pour que mon application devienne la futur version
        majeur de Videoporama.<br>
        D'ici l&#224;, c'est &#224; dire jusqu'&#224; ce que ffDiaporama
        devienne stable, les deux applications vont continuer &#224;
        vivre chacune de son cot&#233;.</p>
      <p style="margin-left: 40px;">Aujourd'hui j'ai mis en ligne la
        premi&#232;re version de test. Il reste encore beaucoup de
        d&#233;tails &#224; r&#233;gler mais l'essentiel du travail est
        fait.</p>
      <div style="margin-left: 40px;"> J'aimerai beaucoup avoir vos
        remarques, critiques, commentaires ...<br>
        ... et pourquoi pas vos contributions pour tester, traduire,
        documenter ...<br>
      </div>
      <br>
      <hr style="width: 100%; height: 2px;">&#169; The ffDiaporama
      Project</div>
  </body>
</html>
